betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sd.c
    When The compilation define USE_DAL_SD_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak (surcharged) callbacks are used.

  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

#if defined(SDIO)

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup SD
  * @{
  */

#ifdef DAL_SD_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup SD_Private_Defines
  * @{
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup SD_Private_Functions SD Private Functions
  * @{
  */
static uint32_t SD_InitCard(SD_HandleTypeDef *hsd);
static uint32_t SD_PowerON(SD_HandleTypeDef *hsd);
static uint32_t SD_SendSDStatus(SD_HandleTypeDef *hsd, uint32_t *pSDstatus);
static uint32_t SD_SendStatus(SD_HandleTypeDef *hsd, uint32_t *pCardStatus);
static uint32_t SD_WideBus_Enable(SD_HandleTypeDef *hsd);
static uint32_t SD_WideBus_Disable(SD_HandleTypeDef *hsd);
static uint32_t SD_FindSCR(SD_HandleTypeDef *hsd, uint32_t *pSCR);
static void SD_PowerOFF(SD_HandleTypeDef *hsd);
static void SD_Write_IT(SD_HandleTypeDef *hsd);
static void SD_Read_IT(SD_HandleTypeDef *hsd);
static void SD_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void SD_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static void SD_DMAError(DMA_HandleTypeDef *hdma);
static void SD_DMATxAbort(DMA_HandleTypeDef *hdma);
static void SD_DMARxAbort(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SD_Exported_Functions
  * @{
  */

/** @addtogroup SD_Exported_Functions_Group1
 *  @brief   Initialization and de-initialization functions
 *
@verbatim
  ==============================================================================
          ##### Initialization and de-initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to initialize/de-initialize the SD
    card device to be ready for use.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SD according to the specified parameters in the
            SD_HandleTypeDef and create the associated handle.
  * @param  hsd: Pointer to the SD handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SD_Init(SD_HandleTypeDef *hsd)
{
  /* Check the SD handle allocation */
  if(hsd == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SDIO_ALL_INSTANCE(hsd->Instance));
  ASSERT_PARAM(IS_SDIO_CLOCK_EDGE(hsd->Init.ClockEdge));
  ASSERT_PARAM(IS_SDIO_CLOCK_BYPASS(hsd->Init.ClockBypass));
  ASSERT_PARAM(IS_SDIO_CLOCK_POWER_SAVE(hsd->Init.ClockPowerSave));
  ASSERT_PARAM(IS_SDIO_BUS_WIDE(hsd->Init.BusWide));
  ASSERT_PARAM(IS_SDIO_HARDWARE_FLOW_CONTROL(hsd->Init.HardwareFlowControl));
  ASSERT_PARAM(IS_SDIO_CLKDIV(hsd->Init.ClockDiv));

  if(hsd->State == DAL_SD_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hsd->Lock = DAL_UNLOCKED;
#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
    /* Reset Callback pointers in DAL_SD_STATE_RESET only */
    hsd->TxCpltCallback    = DAL_SD_TxCpltCallback;
    hsd->RxCpltCallback    = DAL_SD_RxCpltCallback;
    hsd->ErrorCallback     = DAL_SD_ErrorCallback;
    hsd->AbortCpltCallback = DAL_SD_AbortCallback;

    if(hsd->MspInitCallback == NULL)
    {
      hsd->MspInitCallback = DAL_SD_MspInit;
    }

    /* Init the low level hardware */
    hsd->MspInitCallback(hsd);
#else
    /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
    DAL_SD_MspInit(hsd);
#endif /* USE_DAL_SD_REGISTER_CALLBACKS */
  }

  hsd->State = DAL_SD_STATE_BUSY;

  /* Initialize the Card parameters */
  if (DAL_SD_InitCard(hsd) != DAL_OK)
  {
    return DAL_ERROR;
  }

  /* Initialize the error code */
  hsd->ErrorCode = DAL_SD_ERROR_NONE;

  /* Initialize the SD operation */
  hsd->Context = SD_CONTEXT_NONE;

  /* Initialize the SD state */
  hsd->State = DAL_SD_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  Initializes the SD Card.
  * @param  hsd: Pointer to SD handle
  * @note   This function initializes the SD card. It could be used when a card
            re-initialization is needed.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SD_InitCard(SD_HandleTypeDef *hsd)
{
  uint32_t errorstate;
  DAL_StatusTypeDef status;
  SD_InitTypeDef Init;
  
  /* Default SDIO peripheral configuration for SD card initialization */
  Init.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
  Init.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;
  Init.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
  Init.BusWide             = SDIO_BUS_WIDE_1B;
  Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
  Init.ClockDiv            = SDIO_INIT_CLK_DIV;

  /* Initialize SDIO peripheral interface with default configuration */
  status = SDIO_Init(hsd->Instance, Init);
  if(status != DAL_OK)
  {
    return DAL_ERROR;
  }

  /* Disable SDIO Clock */
  __DAL_SD_DISABLE(hsd);

  /* Set Power State to ON */
  (void)SDIO_PowerState_ON(hsd->Instance);

  /* Enable SDIO Clock */
  __DAL_SD_ENABLE(hsd);

  /* Required power up waiting time before starting the SD initialization  sequence */
  DAL_Delay(2);

  /* Identify card operating voltage */
  errorstate = SD_PowerON(hsd);
  if(errorstate != DAL_SD_ERROR_NONE)
  {
    hsd->State = DAL_SD_STATE_READY;
    hsd->ErrorCode |= errorstate;
    return DAL_ERROR;
  }

  /* Card initialization */
  errorstate = SD_InitCard(hsd);
  if(errorstate != DAL_SD_ERROR_NONE)
  {
    hsd->State = DAL_SD_STATE_READY;
    hsd->ErrorCode |= errorstate;
    return DAL_ERROR;
  }

  /* Set Block Size for Card */
  errorstate = SDMMC_CmdBlockLength(hsd->Instance, BLOCKSIZE);
  if(errorstate != DAL_SD_ERROR_NONE)
  {
    /* Clear all the static flags */
    __DAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
    hsd->ErrorCode |= errorstate;
    hsd->State = DAL_SD_STATE_READY;
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  De-Initializes the SD card.
  * @param  hsd: Pointer to SD handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SD_DeInit(SD_HandleTypeDef *hsd)
{
  /* Check the SD handle allocation */
  if(hsd == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SDIO_ALL_INSTANCE(hsd->Instance));

  hsd->State = DAL_SD_STATE_BUSY;

  /* Set SD power state to off */
  SD_PowerOFF(hsd);

#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
  if(hsd->MspDeInitCallback == NULL)
  {
    hsd->MspDeInitCallback = DAL_SD_MspDeInit;
  }

