betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sd.c
    hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);

    if((context & SD_CONTEXT_IT) != 0U)
    {
      /* Set the SD state to ready to be able to start again the process */
      hsd->State = DAL_SD_STATE_READY;
      hsd->Context = SD_CONTEXT_NONE;
#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
      hsd->ErrorCallback(hsd);
#else
      DAL_SD_ErrorCallback(hsd);
#endif /* USE_DAL_SD_REGISTER_CALLBACKS */
    }
    else if((context & SD_CONTEXT_DMA) != 0U)
    {
      /* Abort the SD DMA channel */
      if(((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0U) || ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
      {
        /* Set the DMA Tx abort callback */
        hsd->hdmatx->XferAbortCallback = SD_DMATxAbort;
        /* Abort DMA in IT mode */
        if(DAL_DMA_Abort_IT(hsd->hdmatx) != DAL_OK)
        {
          SD_DMATxAbort(hsd->hdmatx);
        }
      }
      else if(((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) || ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
      {
        /* Set the DMA Rx abort callback */
        hsd->hdmarx->XferAbortCallback = SD_DMARxAbort;
        /* Abort DMA in IT mode */
        if(DAL_DMA_Abort_IT(hsd->hdmarx) != DAL_OK)
        {
          SD_DMARxAbort(hsd->hdmarx);
        }
      }
      else
      {
        hsd->ErrorCode = DAL_SD_ERROR_NONE;
        hsd->State = DAL_SD_STATE_READY;
        hsd->Context = SD_CONTEXT_NONE;
#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
        hsd->AbortCpltCallback(hsd);
#else
        DAL_SD_AbortCallback(hsd);
#endif /* USE_DAL_SD_REGISTER_CALLBACKS */
      }
    }
    else
    {
      /* Nothing to do */
    }
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief return the SD state
  * @param hsd: Pointer to sd handle
  * @retval DAL state
  */
DAL_SD_StateTypeDef DAL_SD_GetState(SD_HandleTypeDef *hsd)
{
  return hsd->State;
}

/**
* @brief  Return the SD error code
* @param  hsd : Pointer to a SD_HandleTypeDef structure that contains
  *              the configuration information.
* @retval SD Error Code
*/
uint32_t DAL_SD_GetError(SD_HandleTypeDef *hsd)
{
  return hsd->ErrorCode;
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd: Pointer to SD handle
  * @retval None
  */
__weak void DAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SD_TxCpltCallback can be implemented in the user file
   */
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd: Pointer SD handle
  * @retval None
  */
__weak void DAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SD_RxCpltCallback can be implemented in the user file
   */
}

/**
  * @brief SD error callbacks
  * @param hsd: Pointer SD handle
  * @retval None
  */
__weak void DAL_SD_ErrorCallback(SD_HandleTypeDef *hsd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SD_ErrorCallback can be implemented in the user file
   */
}

/**
  * @brief SD Abort callbacks
  * @param hsd: Pointer SD handle
  * @retval None
  */
__weak void DAL_SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SD_AbortCallback can be implemented in the user file
   */
}

#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User SD Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hsd : SD handle
  * @param CallbackID : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SD_TX_CPLT_CB_ID    SD Tx Complete Callback ID
  *          @arg @ref DAL_SD_RX_CPLT_CB_ID    SD Rx Complete Callback ID
  *          @arg @ref DAL_SD_ERROR_CB_ID      SD Error Callback ID
  *          @arg @ref DAL_SD_ABORT_CB_ID      SD Abort Callback ID
  *          @arg @ref DAL_SD_MSP_INIT_CB_ID   SD MspInit Callback ID
  *          @arg @ref DAL_SD_MSP_DEINIT_CB_ID SD MspDeInit Callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_SD_RegisterCallback(SD_HandleTypeDef *hsd, DAL_SD_CallbackIDTypeDef CallbackID, pSD_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if(pCallback == NULL)
  {
    /* Update the error code */
    hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hsd);

  if(hsd->State == DAL_SD_STATE_READY)
  {
    switch (CallbackID)
    {
    case DAL_SD_TX_CPLT_CB_ID :
      hsd->TxCpltCallback = pCallback;
      break;
    case DAL_SD_RX_CPLT_CB_ID :
      hsd->RxCpltCallback = pCallback;
      break;
    case DAL_SD_ERROR_CB_ID :
      hsd->ErrorCallback = pCallback;
      break;
    case DAL_SD_ABORT_CB_ID :
      hsd->AbortCpltCallback = pCallback;
      break;
    case DAL_SD_MSP_INIT_CB_ID :
      hsd->MspInitCallback = pCallback;
      break;
    case DAL_SD_MSP_DEINIT_CB_ID :
      hsd->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else if (hsd->State == DAL_SD_STATE_RESET)
  {
    switch (CallbackID)
    {
    case DAL_SD_MSP_INIT_CB_ID :
      hsd->MspInitCallback = pCallback;
      break;
    case DAL_SD_MSP_DEINIT_CB_ID :
      hsd->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsd);
  return status;
}

/**
  * @brief  Unregister a User SD Callback
  *         SD Callback is redirected to the weak (surcharged) predefined callback
  * @param hsd : SD handle
  * @param CallbackID : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SD_TX_CPLT_CB_ID    SD Tx Complete Callback ID
  *          @arg @ref DAL_SD_RX_CPLT_CB_ID    SD Rx Complete Callback ID
  *          @arg @ref DAL_SD_ERROR_CB_ID      SD Error Callback ID
  *          @arg @ref DAL_SD_ABORT_CB_ID      SD Abort Callback ID
  *          @arg @ref DAL_SD_MSP_INIT_CB_ID   SD MspInit Callback ID
  *          @arg @ref DAL_SD_MSP_DEINIT_CB_ID SD MspDeInit Callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_SD_UnRegisterCallback(SD_HandleTypeDef *hsd, DAL_SD_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hsd);

  if(hsd->State == DAL_SD_STATE_READY)
  {
    switch (CallbackID)
    {
    case DAL_SD_TX_CPLT_CB_ID :
      hsd->TxCpltCallback = DAL_SD_TxCpltCallback;
      break;
    case DAL_SD_RX_CPLT_CB_ID :
      hsd->RxCpltCallback = DAL_SD_RxCpltCallback;
      break;
    case DAL_SD_ERROR_CB_ID :
      hsd->ErrorCallback = DAL_SD_ErrorCallback;
      break;
    case DAL_SD_ABORT_CB_ID :
      hsd->AbortCpltCallback = DAL_SD_AbortCallback;
      break;
    case DAL_SD_MSP_INIT_CB_ID :
      hsd->MspInitCallback = DAL_SD_MspInit;
      break;
    case DAL_SD_MSP_DEINIT_CB_ID :
      hsd->MspDeInitCallback = DAL_SD_MspDeInit;
      break;
    default :
      /* Update the error code */
      hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else if (hsd->State == DAL_SD_STATE_RESET)
  {
    switch (CallbackID)
    {
    case DAL_SD_MSP_INIT_CB_ID :
      hsd->MspInitCallback = DAL_SD_MspInit;
      break;
    case DAL_SD_MSP_DEINIT_CB_ID :
      hsd->MspDeInitCallback = DAL_SD_MspDeInit;
      break;
    default :
      /* Update the error code */
      hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hsd->ErrorCode |= DAL_SD_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsd);
  return status;
}
#endif /* USE_DAL_SD_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup SD_Exported_Functions_Group3
 *  @brief   management functions
 *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the SD card
    operations and get the related information

@endverbatim
  * @{
  */

/**
  * @brief  Returns information the information of the card which are stored on
  *         the CID register.
  * @param  hsd: Pointer to SD handle
  * @param  pCID: Pointer to a DAL_SD_CardCIDTypeDef structure that  
  *         contains all CID register parameters
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SD_GetCardCID(SD_HandleTypeDef *hsd, DAL_SD_CardCIDTypeDef *pCID)
{
  pCID->ManufacturerID = (uint8_t)((hsd->CID[0] & 0xFF000000U) >> 24U);

